In [1]:
import pandas as pd
import pyodbc

In [2]:
# connect
conn_str = 'DRIVER={ODBC Driver 17 for SQL Server};\
            SERVER=MSI\DUCNAM;\
            DATABASE=my_database;\
            UID=dn;\
            PWD=123456'

In [3]:
conn = pyodbc.connect(conn_str)

In [4]:
cursor = conn.cursor()
cursor.execute("select * From tblStudent")
data = cursor.fetchall()

In [5]:
for row in data:
    print(row)

(6, 'Jessica', True, datetime.datetime(2005, 11, 30, 0, 0))
(7, 'Daniel', False, datetime.datetime(2006, 2, 5, 0, 0))
(8, 'Olivia', True, datetime.datetime(2007, 4, 10, 0, 0))
(9, 'Matthew', True, datetime.datetime(2008, 6, 15, 0, 0))
(10, 'Sophia', True, datetime.datetime(2009, 8, 20, 0, 0))
(11, 'Thuy Huyen', False, datetime.datetime(2004, 9, 25, 0, 0))
(12, 'Minh Trinh', False, datetime.datetime(2003, 10, 1, 0, 0))
(13, 'Le Thi Thanh Hang', True, datetime.datetime(2003, 3, 29, 0, 0))
(14, 'Dinh Le Duc Nam', True, datetime.datetime(2003, 10, 18, 0, 0))

In [6]:
for row in cursor.description:
    print(row)
header = [column[0] for column in cursor.description]
print(header)

('StudentID', <class 'int'>, None, 10, 10, 0, False)
('fname', <class 'str'>, None, 25, 25, 0, True)
('sex', <class 'bool'>, None, 1, 1, 0, True)
('dob', <class 'datetime.datetime'>, None, 16, 16, 0, True)
['StudentID', 'fname', 'sex', 'dob']

In [7]:
# Add data to DataFrame
new_data = {'StudentID':[15,16,17,18],
            'fname':['Dinh Le Duc Nam', 'Le Thuy Huyen','Tran Binh Nguyen','Nguyen Minh Duc'],
            'sex':[1,1,1,0],
            'dob':['2003-10-18','2003-2-3','2003-10-19','2003-10-10']}
new_df = pd.DataFrame(new_data)
new_df

   StudentID             fname  sex         dob
0         15   Dinh Le Duc Nam    1  2003-10-18
1         16     Le Thuy Huyen    1    2003-2-3
2         17  Tran Binh Nguyen    1  2003-10-19
3         18   Nguyen Minh Duc    0  2003-10-10

In [8]:

cursor = conn.cursor()

for index, row in new_df.iterrows():
    values = (row['StudentID'], row['fname'],row['sex'],row['dob'])
    cursor.execute("INSERT INTO TblStudent (StudentID,fname,sex,dob) VALUES (?,?,?,?)", values)
    conn.commit()

In [9]:
# Update and Delete
    
cursor.execute("Delete TblStudent\
                where StudentID >= 15")
cursor.execute("Update TblStudent\
                Set fname = 'Thuy Huyen'\
                where StudentID = 11")
cursor.commit()

In [10]:
query = 'Select * From TblCourse'
conn = pyodbc.connect(conn_str)
df = pd.read_sql(query,conn)

C:\Users\FPT SHOP\AppData\Local\Temp\ipykernel_4728\763232228.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,conn)

In [11]:
df

   CourseID        CourseName
0         1       Mathematics
1         2           English
2         3           History
3         4           Science
4         5  Computer Science
5         6               Art
6         7           Physics
7         8         Chemistry
8         9           Biology
9        10         Geography

In [12]:
conn.close()